#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖``
<details><summary>Validation Output</summary>

```


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.s3Bucket.aws_s3_bucket.this: Refreshing state... [id=verdant-sphere-landing-fe]
module.s3Bucket.aws_s3_bucket_public_access_block.this: Refreshing state... [id=verdant-sphere-landing-fe]
module.s3Bucket.data.aws_iam_policy_document.allow_access_from_public_policy: Reading...
module.s3Bucket.aws_s3_bucket_server_side_encryption_configuration.this: Refreshing state... [id=verdant-sphere-landing-fe]
module.s3Bucket.data.aws_iam_policy_document.allow_access_from_public_policy: Read complete after 0s [id=2511750817]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.s3Bucket.aws_s3_bucket_policy.allow_access_from_public will be created
  + resource "aws_s3_bucket_policy" "allow_access_from_public" {
      + bucket = "verdant-sphere-landing-fe"
      + id     = (known after apply)
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "s3:GetObject"
                      + Effect    = "Allow"
                      + Principal = "*"
                      + Resource  = [
                          + "arn:aws:s3:::verdant-sphere-landing-fe/*",
                          + "arn:aws:s3:::verdant-sphere-landing-fe",
                        ]
                      + Sid       = "AllowPublicRead"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
    }

  # module.s3Bucket.aws_s3_bucket_website_configuration.website-config will be created
  + resource "aws_s3_bucket_website_configuration" "website-config" {
      + bucket           = "verdant-sphere-landing-fe"
      + id               = (known after apply)
      + routing_rules    = (known after apply)
      + website_domain   = (known after apply)
      + website_endpoint = (known after apply)

      + error_document {
          + key = "404.jpeg"
        }

      + index_document {
          + suffix = "index.html"
        }

      + routing_rule (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @Justro666, Action: `pull_request`, Working Directory: ``, Workflow: `Main Workflow`*